Autodesk.Revit.DB.Subelement.IsValidSubelementReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Checks if given Reference identifies either a valid element or subelement.
Remarks:
A reference to an element or subelement in a linked document is acceptable.
aDoc:
The document.
reference:
The reference that identifies an element or subelement.
Returns:
True if %reference% identifies a valid element or subelement, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Subelement.HasParameter(Autodesk.Revit.DB.ElementId)
Checks if this subelement have given parameter.
parameterId:
Parameter id.
Returns:
True if %parameterId% identifies valid parameter of this subelement, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Subelement.IsParameterModifiable(Autodesk.Revit.DB.ElementId)
Checks if given parameter of this subelement is modifiable.
parameterId:
Parameter id.
Returns:
True if given parameter of this subelement is modifiable, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Subelement.SetParameterValue(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ParameterValue)
Sets a new parameter value of this subelement given a parameter id.
parameterId:
Parameter id.
pValue:
New value for the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
parameterId does not identify a valid parameter of this subelement.
-or-
The parameter parameterId is not modifiable for this subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Subelement.GetParameterValue(Autodesk.Revit.DB.ElementId)
Obtains the current parameter value of this subelement given a parameter id.
parameterId:
Parameter id.
Returns:
Parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
parameterId does not identify a valid parameter of this subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Subelement.ChangeTypeId(Autodesk.Revit.DB.ElementId)
Changes the type of the subelement.
Remarks:
In rare cases, applying a change in type will result in a new element being created.
The only active examples of this are when:
Applying a normal wall type to a curtain panel. Converting such a wall back to a curtain panel. Applying a new type to a railing subelement.
In this situation this subelement object will be redirected to the new element.
typeId:
Identifier of the type to assign to this subelement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The type typeId is not valid for this subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Subelement cannot have type assigned.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Subelement is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Subelement is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Subelement is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2018

Autodesk.Revit.DB.Subelement.IsValidType(Autodesk.Revit.DB.ElementId)
Checks if given type is valid for this subelement.
Remarks:
A type is valid for a subelement if it can be assigned to the subelement.
typeId:
ElementId of the type to check.
Returns:
True if subelement can have a type assigned and this type is valid for this subelement, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Subelement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Creates an object representing element or subelement.
Remarks:
If %reference% points to linked document:
The Autodesk.Revit.DB.Subelement.GetReference method of the newly created subelement will return the local reference in the linked document. The Autodesk.Revit.DB.Subelement.Document property of the newly created subelement will return the linked document.
aDoc:
The document.
reference:
The reference that identifies element or subelement.
Returns:
The newly created subelement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference does not identify a valid element or subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018